[
  {
    "user_input": "opening Spotify close Spotify",
    "bot_response": "It seems that you are deciding whether to open or close Spotify - what is your reasoning?",
    "reward": 33,
    "ts": 1754681874.4558148
  },
  {
    "user_input": "what's up with you today how are you",
    "bot_response": "Blake! It's great to chat with you again. Since you asked \"what's up,\" I'll assume we're starting fresh and not referencing any previous conversations. How about I grab the coffee, and we start with something light?",
    "reward": 18,
    "ts": 1754681961.938035
  },
  {
    "user_input": "what's up with you today",
    "bot_response": "Nice to chat with you again! It's great to see what's new in your world. How about I grab the coffee, and we start with something light?",
    "reward": 21,
    "ts": 1754682838.582415
  },
  {
    "user_input": "what's up",
    "bot_response": "Nice to chat with you again! Since you asked \"what's up,\" how about I grab the coffee, and we start with something light?",
    "reward": 28,
    "ts": 1754683718.130464
  },
  {
    "user_input": "clear",
    "bot_response": "It seems that we are starting fresh again, how about I grab the coffee, and we start with something light? It seems like you are looking for some conversation starters.",
    "reward": 5,
    "ts": 1754685181.706669
  },
  {
    "user_input": "what's up",
    "bot_response": "Nice to chat with you again! Since you asked \"what's up,\" how about I grab the coffee, and we start with something light?",
    "reward": 28,
    "ts": 1754685206.6583428
  },
  {
    "user_input": "what's up how are you today",
    "bot_response": "Since you asked\" what's up, \" I'll assume we're starting fresh and not referencing any previous conversations. By the way, have you been up to anything exciting recently, like hitting the slopes or playing some tennis ? Nice to chat with you again ! Catch up",
    "reward": 8,
    "ts": 1754686081.013154
  },
  {
    "user_input": "I'm doing well thanks for asking",
    "bot_response": "Nice to chat with you again! So, how about we talk about something more substantial? You mentioned playing tennis earlier - have you found a new racket or technique that's been working well for you?",
    "reward": 31,
    "ts": 1754686124.129884
  },
  {
    "user_input": "what's up",
    "bot_response": "So, what's new ? You've got a few hobbies mentioned in your profile - what's been new or exciting lately in the world of skiing or tennis ?",
    "reward": 28,
    "ts": 1754841286.590229
  },
  {
    "user_input": "what's up",
    "bot_response": "Nice to chat with you again! Since you asked \"what's up\", how about I grab the coffee, and we start with something light? By the way, have you been up to anything exciting recently, like hitting the slopes or playing some tennis ? Nice to chat with you again ! Catch up.",
    "reward": 14,
    "ts": 1755279940.5838668
  }
]